Revit 2027 API
RevisionSettings.RoundRevisionCloudSpacing Method
 Rounds the given revision cloud spacing value according to the document's settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double RoundRevisionCloudSpacing(
	Document ccda,
	double rawValue
)
Public Shared Function RoundRevisionCloudSpacing (
	ccda As Document,
	rawValue As Double
) As Double
public:
static double RoundRevisionCloudSpacing(
	Document^ ccda,
	double rawValue
)
static member RoundRevisionCloudSpacing :
        ccda : Document *
        rawValue : float -> float
Parameters
ccda Document
 The document to use for rounding.
rawValue Double
 The unrounded value.
Return Value
Double
 The rounded revision cloud spacing.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevisionSettings Class
Autodesk.Revit.DB Namespace